export const lessons = [
  {
    id: 0,
    title: 'Заполнить раздел "О себе"',
    aim: "Рассказать о себе и сформулировать для себя результат обучения.",
    description:
      "Все начинается со знакомства.\n" +
      "Подробная информация о вашем опыте и профессиональных компетенциях поможет преподавателям быстрее узнать аудиторию и скорректировать программу так, чтобы занятия были наиболее интересны и полезны для вас. А определение результатов обучения поможет сделать процесс более целенаправленным.",
    homework: "Смотреть профиль",
  },
  {
    id: 1,
    title: "Введение в курс Modern JavaScript Frameworks",
    aim:
      "познакомиться с преподавателем и с программой курса, понимать как она построена и какие полезные навыки получите;\n" +
      "объяснить основные возможности языка JavaScript;\n" +
      "применять техники языка, которые помогут при изучении фреймворков.",
    description:
      "организационные вопросы по курсу;\n" +
      "типы данных;\n" +
      "переменные;\n" +
      "функции;\n" +
      "замыкания.",
    homework: null,
  },
  {
    id: 2,
    title: "Возможности современного JavaScript",
    aim:
      "решать специфичные для браузерной разработки задачи на языке JavaScript;\n" +
      "освоить и вспомнить теорию, которая будет базисом для последующих уроков;\n" +
      "попрактиковаться с технологиями AJAX, WebSocket, Promise.",
    description: "наследование; promise; Async Patterns; обзор ES6 Features.",
    homework: null,
  },
  {
    id: 3,
    title: "JavaScript - Работа с браузером",
    aim:
      "решать специфичные для браузерной разработки задачи на языке JavaScript;\n" +
      "работать с Chrome Dev Tools.",
    description: "DOM API; DevTools; events.",
    homework: null,
  },
];
